/*
 * Напиши скрипт обработки покупки в магазине.
 *
 * - Баланс пользователя хранится в переменной balance
 * - Сумма покупки хранится в переменной payment
 *
 * - Перед проверкой вывести сообщение:
 * «Общая стоимость заказа [число] кредитов. Проверяем кол-во доступных средств на счету»
 *
 * - Если сумма покупки не превышает баланс:
 *    - Вычесть из баланса сумму покупки
 *    - Вывести сообщение «На счету осталось [число] кредитов»
 * - Если сумма покупки превышает баланс:
 *    - Вывести сообщение «На счету недостаточно средств для проведения операции!»
 * - В конце вывести сообщение «Операция завершена»
 */

let balance = 10000;
const payment = 25030;

// 1 Вывести начальное сообщение с переменными
console.log(
  `Общая стоимость заказа ${payment} кредитов. Проверяем кол-во доступных средств на счету`,
);

// 2 Проверка баланса
if (balance >= payment) {
  // 3.1 Вычитаем сумму покупки
  balance -= payment;
  // balance = balance - payment;

  console.log(`На счету осталось ${balance} кредитов`);
} else {
  // 3.2 вывести сообщение "нет денег!"
  console.log('На счету недостаточно средств для проведения операции!');
  console.log(`Нужно ещё ${payment - balance} денег`);
}
